HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_ATOM_CH_SOMS_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_SOMS_ARU_EN_OFF (3)

/** \\brief  Length for Ifx_GTM_ATOM_CH_SOMS_Bits.CLK_SRC */
#define IFX_GTM_ATOM_CH_SOMS_CLK_SRC_LEN (3)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_SOMS_Bits.CLK_SRC */
#define IFX_GTM_ATOM_CH_SOMS_CLK_SRC_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_SOMS_Bits.CLK_SRC */
#define IFX_GTM_ATOM_CH_SOMS_CLK_SRC_OFF (12)

/** \\brief  Length for Ifx_GTM_ATOM_CH_SOMS_Bits.MODE */
#define IFX_GTM_ATOM_CH_SOMS_MODE_LEN (2)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_SOMS_Bits.MODE */
#define IFX_GTM_ATOM_CH_SOMS_MODE_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_SOMS_Bits.MODE */
#define IFX_GTM_ATOM_CH_SOMS_MODE_OFF (0)

/** \\brief  Length for Ifx_GTM_ATOM_CH_SOMS_Bits.OSM */
#define IFX_GTM_ATOM_CH_SOMS_OSM_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_SOMS_Bits.OSM */
#define IFX_GTM_ATOM_CH_SOMS_OSM_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_SOMS_Bits.OSM */
#define IFX_GTM_ATOM_CH_SOMS_OSM_OFF (26)

/** \\brief  Length for Ifx_GTM_ATOM_CH_SOMS_Bits.SL */
#define IFX_GTM_ATOM_CH_SOMS_SL_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_SOMS_Bits.SL */
#define IFX_GTM_ATOM_CH_SOMS_SL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_SOMS_Bits.SL */
#define IFX_GTM_ATOM_CH_SOMS_SL_OFF (11)

/** \\brief  Length for Ifx_GTM_ATOM_CH_SR0_Bits.SR0 */
#define IFX_GTM_ATOM_CH_SR0_SR0_LEN (24)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_SR0_Bits.SR0 */
#define IFX_GTM_ATOM_CH_SR0_SR0_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_SR0_Bits.SR0 */
#define IFX_GTM_ATOM_CH_SR0_SR0_OFF (0)

/** \\brief  Length for Ifx_GTM_ATOM_CH_SR1_Bits.SR1 */
#define IFX_GTM_ATOM_CH_SR1_SR1_LEN (24)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_SR1_Bits.SR1 */
#define IFX_GTM_ATOM_CH_SR1_SR1_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_SR1_Bits.SR1 */
#define IFX_GTM_ATOM_CH_SR1_SR1_OFF (0)

/** \\brief  Length for Ifx_GTM_ATOM_CH_STAT_Bits.ACBI */
#define IFX_GTM_ATOM_CH_STAT_ACBI_LEN (5)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_STAT_Bits.ACBI */
#define IFX_GTM_ATOM_CH_STAT_ACBI_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_STAT_Bits.ACBI */
#define IFX_GTM_ATOM_CH_STAT_ACBI_OFF (16)

/** \\brief  Length for Ifx_GTM_ATOM_CH_STAT_Bits.ACBO */
#define IFX_GTM_ATOM_CH_STAT_ACBO_LEN (5)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_STAT_Bits.ACBO */
#define IFX_GTM_ATOM_CH_STAT_ACBO_MSK (0x1f)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_STAT_Bits.ACBO */
#define IFX_GTM_ATOM_CH_STAT_ACBO_OFF (24)

/** \\brief  Length for Ifx_GTM_ATOM_CH_STAT_Bits.DV */
#define IFX_GTM_ATOM_CH_STAT_DV_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_STAT_Bits.DV */
#define IFX_GTM_ATOM_CH_STAT_DV_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_STAT_Bits.DV */
#define IFX_GTM_ATOM_CH_STAT_DV_OFF (21)

/** \\brief  Length for Ifx_GTM_ATOM_CH_STAT_Bits.OL */
#define IFX_GTM_ATOM_CH_STAT_OL_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_STAT_Bits.OL */
#define IFX_GTM_ATOM_CH_STAT_OL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_STAT_Bits.OL */
#define IFX_GTM_ATOM_CH_STAT_OL_OFF (0)

/** \\brief  Length for Ifx_GTM_ATOM_CH_STAT_Bits.WRF */
#define IFX_GTM_ATOM_CH_STAT_WRF_LEN (1)

/** \\brief  Mask for Ifx_GTM_ATOM_CH_STAT_Bits.WRF */
#define IFX_GTM_ATOM_CH_STAT_WRF_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ATOM_CH_STAT_Bits.WRF */
#define IFX_GTM_ATOM_CH_STAT_WRF_OFF (22)

/** \\brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DEST_ERR_EN */
#define IFX_GTM_BRC_EIRQ_EN_DEST_ERR_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DEST_ERR_EN */
#define IFX_GTM_BRC_EIRQ_EN_DEST_ERR_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DEST_ERR_EN */
#define IFX_GTM_BRC_EIRQ_EN_DEST_ERR_EN_OFF (0)

/** \\brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN0 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN0_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN0 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN0 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN0_OFF (1)

/** \\brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN10 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN10_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN10 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN10_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN10 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN10_OFF (11)

/** \\brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN11 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN11_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN11 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN11_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN11 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN11_OFF (12)

/** \\brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN1 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN1_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN1 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN1 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN1_OFF (2)

/** \\brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN2 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN2_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN2 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN2 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN2_OFF (3)

/** \\brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN3 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN3_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN3 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN3 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN3_OFF (4)

/** \\brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN4 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN4_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN4 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN4 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN4_OFF (5)

/** \\brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN5 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN5_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN5 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN5 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN5_OFF (6)

/** \\brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN6 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN6_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN6 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN6 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN6_OFF (7)

