HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID7 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID7_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID7 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID7 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID7_OFF (8)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID8 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID8_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID8 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID8_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID8 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID8_OFF (9)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID9 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID9_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID9 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID9_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_NOTIFY_Bits.DID9 */
#define IFX_GTM_BRC_IRQ_NOTIFY_DID9_OFF (10)

/** \\brief  Length for Ifx_GTM_BRC_RST_Bits.RST */
#define IFX_GTM_BRC_RST_RST_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_RST_Bits.RST */
#define IFX_GTM_BRC_RST_RST_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_RST_Bits.RST */
#define IFX_GTM_BRC_RST_RST_OFF (0)

/** \\brief  Length for Ifx_GTM_BRC_SRC0_ADDR_Bits.ADDR */
#define IFX_GTM_BRC_SRC0_ADDR_ADDR_LEN (9)

/** \\brief  Mask for Ifx_GTM_BRC_SRC0_ADDR_Bits.ADDR */
#define IFX_GTM_BRC_SRC0_ADDR_ADDR_MSK (0x1ff)

/** \\brief  Offset for Ifx_GTM_BRC_SRC0_ADDR_Bits.ADDR */
#define IFX_GTM_BRC_SRC0_ADDR_ADDR_OFF (0)

/** \\brief  Length for Ifx_GTM_BRC_SRC0_ADDR_Bits.BRC_MODE */
#define IFX_GTM_BRC_SRC0_ADDR_BRC_MODE_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC0_ADDR_Bits.BRC_MODE */
#define IFX_GTM_BRC_SRC0_ADDR_BRC_MODE_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC0_ADDR_Bits.BRC_MODE */
#define IFX_GTM_BRC_SRC0_ADDR_BRC_MODE_OFF (12)

/** \\brief  Length for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST0 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST0_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST0 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST0 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST0_OFF (0)

/** \\brief  Length for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST10 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST10_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST10 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST10_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST10 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST10_OFF (10)

/** \\brief  Length for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST11 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST11_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST11 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST11_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST11 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST11_OFF (11)

/** \\brief  Length for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST12 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST12_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST12 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST12_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST12 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST12_OFF (12)

/** \\brief  Length for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST13 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST13_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST13 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST13_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST13 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST13_OFF (13)

/** \\brief  Length for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST14 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST14_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST14 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST14_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST14 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST14_OFF (14)

/** \\brief  Length for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST15 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST15_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST15 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST15_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST15 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST15_OFF (15)

/** \\brief  Length for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST16 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST16_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST16 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST16_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST16 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST16_OFF (16)

/** \\brief  Length for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST17 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST17_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST17 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST17_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST17 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST17_OFF (17)

/** \\brief  Length for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST18 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST18_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST18 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST18_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST18 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST18_OFF (18)

/** \\brief  Length for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST19 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST19_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST19 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST19_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST19 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST19_OFF (19)

/** \\brief  Length for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST1 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST1_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST1 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST1 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST1_OFF (1)

/** \\brief  Length for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST20 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST20_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST20 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST20_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST20 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST20_OFF (20)

/** \\brief  Length for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST21 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST21_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC0_DEST_Bits.EN_DEST21 */
#define IFX_GTM_BRC_SRC0_DEST_EN_DEST21_MSK (0x1)

