HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_BRC_SRC7_DEST_Bits.EN_DEST3 */
#define IFX_GTM_BRC_SRC7_DEST_EN_DEST3_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC7_DEST_Bits.EN_DEST3 */
#define IFX_GTM_BRC_SRC7_DEST_EN_DEST3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC7_DEST_Bits.EN_DEST3 */
#define IFX_GTM_BRC_SRC7_DEST_EN_DEST3_OFF (3)

/** \\brief  Length for Ifx_GTM_BRC_SRC7_DEST_Bits.EN_DEST4 */
#define IFX_GTM_BRC_SRC7_DEST_EN_DEST4_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC7_DEST_Bits.EN_DEST4 */
#define IFX_GTM_BRC_SRC7_DEST_EN_DEST4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC7_DEST_Bits.EN_DEST4 */
#define IFX_GTM_BRC_SRC7_DEST_EN_DEST4_OFF (4)

/** \\brief  Length for Ifx_GTM_BRC_SRC7_DEST_Bits.EN_DEST5 */
#define IFX_GTM_BRC_SRC7_DEST_EN_DEST5_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC7_DEST_Bits.EN_DEST5 */
#define IFX_GTM_BRC_SRC7_DEST_EN_DEST5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC7_DEST_Bits.EN_DEST5 */
#define IFX_GTM_BRC_SRC7_DEST_EN_DEST5_OFF (5)

/** \\brief  Length for Ifx_GTM_BRC_SRC7_DEST_Bits.EN_DEST6 */
#define IFX_GTM_BRC_SRC7_DEST_EN_DEST6_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC7_DEST_Bits.EN_DEST6 */
#define IFX_GTM_BRC_SRC7_DEST_EN_DEST6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC7_DEST_Bits.EN_DEST6 */
#define IFX_GTM_BRC_SRC7_DEST_EN_DEST6_OFF (6)

/** \\brief  Length for Ifx_GTM_BRC_SRC7_DEST_Bits.EN_DEST7 */
#define IFX_GTM_BRC_SRC7_DEST_EN_DEST7_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC7_DEST_Bits.EN_DEST7 */
#define IFX_GTM_BRC_SRC7_DEST_EN_DEST7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC7_DEST_Bits.EN_DEST7 */
#define IFX_GTM_BRC_SRC7_DEST_EN_DEST7_OFF (7)

/** \\brief  Length for Ifx_GTM_BRC_SRC7_DEST_Bits.EN_DEST8 */
#define IFX_GTM_BRC_SRC7_DEST_EN_DEST8_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC7_DEST_Bits.EN_DEST8 */
#define IFX_GTM_BRC_SRC7_DEST_EN_DEST8_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC7_DEST_Bits.EN_DEST8 */
#define IFX_GTM_BRC_SRC7_DEST_EN_DEST8_OFF (8)

/** \\brief  Length for Ifx_GTM_BRC_SRC7_DEST_Bits.EN_DEST9 */
#define IFX_GTM_BRC_SRC7_DEST_EN_DEST9_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC7_DEST_Bits.EN_DEST9 */
#define IFX_GTM_BRC_SRC7_DEST_EN_DEST9_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC7_DEST_Bits.EN_DEST9 */
#define IFX_GTM_BRC_SRC7_DEST_EN_DEST9_OFF (9)

/** \\brief  Length for Ifx_GTM_BRC_SRC7_DEST_Bits.EN_TRASHBIN */
#define IFX_GTM_BRC_SRC7_DEST_EN_TRASHBIN_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC7_DEST_Bits.EN_TRASHBIN */
#define IFX_GTM_BRC_SRC7_DEST_EN_TRASHBIN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC7_DEST_Bits.EN_TRASHBIN */
#define IFX_GTM_BRC_SRC7_DEST_EN_TRASHBIN_OFF (22)

/** \\brief  Length for Ifx_GTM_BRC_SRC8_ADDR_Bits.ADDR */
#define IFX_GTM_BRC_SRC8_ADDR_ADDR_LEN (9)

/** \\brief  Mask for Ifx_GTM_BRC_SRC8_ADDR_Bits.ADDR */
#define IFX_GTM_BRC_SRC8_ADDR_ADDR_MSK (0x1ff)

/** \\brief  Offset for Ifx_GTM_BRC_SRC8_ADDR_Bits.ADDR */
#define IFX_GTM_BRC_SRC8_ADDR_ADDR_OFF (0)

/** \\brief  Length for Ifx_GTM_BRC_SRC8_ADDR_Bits.BRC_MODE */
#define IFX_GTM_BRC_SRC8_ADDR_BRC_MODE_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC8_ADDR_Bits.BRC_MODE */
#define IFX_GTM_BRC_SRC8_ADDR_BRC_MODE_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC8_ADDR_Bits.BRC_MODE */
#define IFX_GTM_BRC_SRC8_ADDR_BRC_MODE_OFF (12)

/** \\brief  Length for Ifx_GTM_BRC_SRC8_DEST_Bits.EN_DEST0 */
#define IFX_GTM_BRC_SRC8_DEST_EN_DEST0_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC8_DEST_Bits.EN_DEST0 */
#define IFX_GTM_BRC_SRC8_DEST_EN_DEST0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC8_DEST_Bits.EN_DEST0 */
#define IFX_GTM_BRC_SRC8_DEST_EN_DEST0_OFF (0)

/** \\brief  Length for Ifx_GTM_BRC_SRC8_DEST_Bits.EN_DEST10 */
#define IFX_GTM_BRC_SRC8_DEST_EN_DEST10_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC8_DEST_Bits.EN_DEST10 */
#define IFX_GTM_BRC_SRC8_DEST_EN_DEST10_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC8_DEST_Bits.EN_DEST10 */
#define IFX_GTM_BRC_SRC8_DEST_EN_DEST10_OFF (10)

/** \\brief  Length for Ifx_GTM_BRC_SRC8_DEST_Bits.EN_DEST11 */
#define IFX_GTM_BRC_SRC8_DEST_EN_DEST11_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC8_DEST_Bits.EN_DEST11 */
#define IFX_GTM_BRC_SRC8_DEST_EN_DEST11_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC8_DEST_Bits.EN_DEST11 */
#define IFX_GTM_BRC_SRC8_DEST_EN_DEST11_OFF (11)

/** \\brief  Length for Ifx_GTM_BRC_SRC8_DEST_Bits.EN_DEST12 */
#define IFX_GTM_BRC_SRC8_DEST_EN_DEST12_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC8_DEST_Bits.EN_DEST12 */
#define IFX_GTM_BRC_SRC8_DEST_EN_DEST12_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC8_DEST_Bits.EN_DEST12 */
#define IFX_GTM_BRC_SRC8_DEST_EN_DEST12_OFF (12)

/** \\brief  Length for Ifx_GTM_BRC_SRC8_DEST_Bits.EN_DEST13 */
#define IFX_GTM_BRC_SRC8_DEST_EN_DEST13_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC8_DEST_Bits.EN_DEST13 */
#define IFX_GTM_BRC_SRC8_DEST_EN_DEST13_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC8_DEST_Bits.EN_DEST13 */
#define IFX_GTM_BRC_SRC8_DEST_EN_DEST13_OFF (13)

/** \\brief  Length for Ifx_GTM_BRC_SRC8_DEST_Bits.EN_DEST14 */
#define IFX_GTM_BRC_SRC8_DEST_EN_DEST14_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC8_DEST_Bits.EN_DEST14 */
#define IFX_GTM_BRC_SRC8_DEST_EN_DEST14_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC8_DEST_Bits.EN_DEST14 */
#define IFX_GTM_BRC_SRC8_DEST_EN_DEST14_OFF (14)

/** \\brief  Length for Ifx_GTM_BRC_SRC8_DEST_Bits.EN_DEST15 */
#define IFX_GTM_BRC_SRC8_DEST_EN_DEST15_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC8_DEST_Bits.EN_DEST15 */
#define IFX_GTM_BRC_SRC8_DEST_EN_DEST15_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC8_DEST_Bits.EN_DEST15 */
#define IFX_GTM_BRC_SRC8_DEST_EN_DEST15_OFF (15)

/** \\brief  Length for Ifx_GTM_BRC_SRC8_DEST_Bits.EN_DEST16 */
#define IFX_GTM_BRC_SRC8_DEST_EN_DEST16_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_SRC8_DEST_Bits.EN_DEST16 */
#define IFX_GTM_BRC_SRC8_DEST_EN_DEST16_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_SRC8_DEST_Bits.EN_DEST16 */
#define IFX_GTM_BRC_SRC8_DEST_EN_DEST16_OFF (16)

