HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_DXINCON_Bits.DSS11 */
#define IFX_GTM_DXINCON_DSS11_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.DSS11 */
#define IFX_GTM_DXINCON_DSS11_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.DSS11 */
#define IFX_GTM_DXINCON_DSS11_OFF (25)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.DSS12 */
#define IFX_GTM_DXINCON_DSS12_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.DSS12 */
#define IFX_GTM_DXINCON_DSS12_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.DSS12 */
#define IFX_GTM_DXINCON_DSS12_OFF (26)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.DSS13 */
#define IFX_GTM_DXINCON_DSS13_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.DSS13 */
#define IFX_GTM_DXINCON_DSS13_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.DSS13 */
#define IFX_GTM_DXINCON_DSS13_OFF (27)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.DSS14 */
#define IFX_GTM_DXINCON_DSS14_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.DSS14 */
#define IFX_GTM_DXINCON_DSS14_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.DSS14 */
#define IFX_GTM_DXINCON_DSS14_OFF (28)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.DSS15 */
#define IFX_GTM_DXINCON_DSS15_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.DSS15 */
#define IFX_GTM_DXINCON_DSS15_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.DSS15 */
#define IFX_GTM_DXINCON_DSS15_OFF (29)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.IN00 */
#define IFX_GTM_DXINCON_IN00_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.IN00 */
#define IFX_GTM_DXINCON_IN00_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.IN00 */
#define IFX_GTM_DXINCON_IN00_OFF (0)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.IN01 */
#define IFX_GTM_DXINCON_IN01_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.IN01 */
#define IFX_GTM_DXINCON_IN01_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.IN01 */
#define IFX_GTM_DXINCON_IN01_OFF (1)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.IN02 */
#define IFX_GTM_DXINCON_IN02_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.IN02 */
#define IFX_GTM_DXINCON_IN02_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.IN02 */
#define IFX_GTM_DXINCON_IN02_OFF (2)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.IN03 */
#define IFX_GTM_DXINCON_IN03_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.IN03 */
#define IFX_GTM_DXINCON_IN03_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.IN03 */
#define IFX_GTM_DXINCON_IN03_OFF (3)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.IN04 */
#define IFX_GTM_DXINCON_IN04_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.IN04 */
#define IFX_GTM_DXINCON_IN04_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.IN04 */
#define IFX_GTM_DXINCON_IN04_OFF (4)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.IN05 */
#define IFX_GTM_DXINCON_IN05_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.IN05 */
#define IFX_GTM_DXINCON_IN05_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.IN05 */
#define IFX_GTM_DXINCON_IN05_OFF (5)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.IN10 */
#define IFX_GTM_DXINCON_IN10_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.IN10 */
#define IFX_GTM_DXINCON_IN10_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.IN10 */
#define IFX_GTM_DXINCON_IN10_OFF (8)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.IN11 */
#define IFX_GTM_DXINCON_IN11_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.IN11 */
#define IFX_GTM_DXINCON_IN11_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.IN11 */
#define IFX_GTM_DXINCON_IN11_OFF (9)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.IN12 */
#define IFX_GTM_DXINCON_IN12_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.IN12 */
#define IFX_GTM_DXINCON_IN12_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.IN12 */
#define IFX_GTM_DXINCON_IN12_OFF (10)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.IN13 */
#define IFX_GTM_DXINCON_IN13_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.IN13 */
#define IFX_GTM_DXINCON_IN13_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.IN13 */
#define IFX_GTM_DXINCON_IN13_OFF (11)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.IN14 */
#define IFX_GTM_DXINCON_IN14_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.IN14 */
#define IFX_GTM_DXINCON_IN14_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.IN14 */
#define IFX_GTM_DXINCON_IN14_OFF (12)

/** \\brief  Length for Ifx_GTM_DXINCON_Bits.IN15 */
#define IFX_GTM_DXINCON_IN15_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXINCON_Bits.IN15 */
#define IFX_GTM_DXINCON_IN15_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXINCON_Bits.IN15 */
#define IFX_GTM_DXINCON_IN15_OFF (13)

/** \\brief  Length for Ifx_GTM_DXOUTCON_Bits.OUT00 */
#define IFX_GTM_DXOUTCON_OUT00_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXOUTCON_Bits.OUT00 */
#define IFX_GTM_DXOUTCON_OUT00_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXOUTCON_Bits.OUT00 */
#define IFX_GTM_DXOUTCON_OUT00_OFF (0)

/** \\brief  Length for Ifx_GTM_DXOUTCON_Bits.OUT01 */
#define IFX_GTM_DXOUTCON_OUT01_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXOUTCON_Bits.OUT01 */
#define IFX_GTM_DXOUTCON_OUT01_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXOUTCON_Bits.OUT01 */
#define IFX_GTM_DXOUTCON_OUT01_OFF (1)

/** \\brief  Length for Ifx_GTM_DXOUTCON_Bits.OUT02 */
#define IFX_GTM_DXOUTCON_OUT02_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXOUTCON_Bits.OUT02 */
#define IFX_GTM_DXOUTCON_OUT02_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXOUTCON_Bits.OUT02 */
#define IFX_GTM_DXOUTCON_OUT02_OFF (2)

/** \\brief  Length for Ifx_GTM_DXOUTCON_Bits.OUT03 */
#define IFX_GTM_DXOUTCON_OUT03_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXOUTCON_Bits.OUT03 */
#define IFX_GTM_DXOUTCON_OUT03_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXOUTCON_Bits.OUT03 */
#define IFX_GTM_DXOUTCON_OUT03_OFF (3)

/** \\brief  Length for Ifx_GTM_DXOUTCON_Bits.OUT04 */
#define IFX_GTM_DXOUTCON_OUT04_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXOUTCON_Bits.OUT04 */
#define IFX_GTM_DXOUTCON_OUT04_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXOUTCON_Bits.OUT04 */
#define IFX_GTM_DXOUTCON_OUT04_OFF (4)

/** \\brief  Length for Ifx_GTM_DXOUTCON_Bits.OUT05 */
#define IFX_GTM_DXOUTCON_OUT05_LEN (1)

/** \\brief  Mask for Ifx_GTM_DXOUTCON_Bits.OUT05 */
#define IFX_GTM_DXOUTCON_OUT05_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DXOUTCON_Bits.OUT05 */
#define IFX_GTM_DXOUTCON_OUT05_OFF (5)

