HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH4_IRQ_OFF (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH5_IRQ_OFF (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH6_IRQ_OFF (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH7_IRQ_OFF (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH8_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH8_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH8_IRQ_OFF (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH9_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH9_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_7_Bits.TOM3_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_7_TOM3_CH9_IRQ_OFF (25)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH0_IRQ_OFF (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH10_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH10_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH10_IRQ_OFF (10)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH11_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH11_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH11_IRQ_OFF (11)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH12_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH12_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH12_IRQ_OFF (12)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH13_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH13_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH13_IRQ_OFF (13)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH14_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH14_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH14_IRQ_OFF (14)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH15_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH15_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH15_IRQ_OFF (15)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH1_IRQ_OFF (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH2_IRQ_OFF (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH3_IRQ_OFF (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH4_IRQ_OFF (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH5_IRQ_OFF (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH6_IRQ_OFF (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_8_Bits.TOM4_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_8_TOM4_CH7_IRQ_LEN (1)

