HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH1_IRQ_OFF (17)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH2_IRQ_OFF (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH3_IRQ_OFF (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH4_IRQ_OFF (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH5_IRQ_OFF (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH6_IRQ_OFF (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH7_IRQ_OFF (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH0_IRQ_OFF (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH1_IRQ_OFF (25)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH2_IRQ_OFF (26)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH3_IRQ_OFF (27)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH4_IRQ_OFF (28)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH5_IRQ_OFF (29)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH6_IRQ_OFF (30)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH7_IRQ_OFF (31)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH0_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH0_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH0_EIRQ_OFF (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH1_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH1_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH1_EIRQ_OFF (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI0_Bits.FIFO0_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI0_FIFO0_CH2_EIRQ_LEN (1)

