HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS2_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS2_CH6_EIRQ_OFF (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS2_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS2_CH7_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS2_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS2_CH7_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS2_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS2_CH7_EIRQ_OFF (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS3_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS3_CH0_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS3_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS3_CH0_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS3_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS3_CH0_EIRQ_OFF (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS3_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS3_CH1_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS3_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS3_CH1_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS3_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS3_CH1_EIRQ_OFF (25)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS3_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS3_CH2_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS3_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS3_CH2_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS3_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS3_CH2_EIRQ_OFF (26)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS3_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS3_CH3_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS3_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS3_CH3_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS3_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS3_CH3_EIRQ_OFF (27)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS3_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS3_CH4_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS3_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS3_CH4_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS3_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS3_CH4_EIRQ_OFF (28)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS3_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS3_CH5_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS3_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS3_CH5_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS3_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS3_CH5_EIRQ_OFF (29)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS3_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS3_CH6_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS3_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS3_CH6_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS3_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS3_CH6_EIRQ_OFF (30)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS3_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS3_CH7_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS3_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS3_CH7_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI3_Bits.MCS3_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI3_MCS3_CH7_EIRQ_OFF (31)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS4_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS4_CH0_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS4_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS4_CH0_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS4_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS4_CH0_EIRQ_OFF (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS4_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS4_CH1_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS4_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS4_CH1_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS4_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS4_CH1_EIRQ_OFF (1)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS4_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS4_CH2_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS4_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS4_CH2_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS4_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS4_CH2_EIRQ_OFF (2)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS4_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS4_CH3_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS4_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS4_CH3_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS4_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS4_CH3_EIRQ_OFF (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS4_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS4_CH4_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS4_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS4_CH4_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS4_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS4_CH4_EIRQ_OFF (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS4_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS4_CH5_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS4_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS4_CH5_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS4_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS4_CH5_EIRQ_OFF (5)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS4_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS4_CH6_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS4_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS4_CH6_EIRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS4_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS4_CH6_EIRQ_OFF (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS4_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS4_CH7_EIRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS4_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS4_CH7_EIRQ_MSK (0x1)

