HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL12 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL12_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL12 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL12_OFF (24)

/** \\brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL13 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL13_LEN (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL13 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL13_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL13 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL13_OFF (26)

/** \\brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL14 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL14_LEN (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL14 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL14_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL14 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL14_OFF (28)

/** \\brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL15 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL15_LEN (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL15 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL15_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL15 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL15_OFF (30)

/** \\brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL1_LEN (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL1_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL1_OFF (2)

/** \\brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL2_LEN (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL2_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL2_OFF (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL3_LEN (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL3_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL3_OFF (6)

/** \\brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL4_LEN (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL4_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL4_OFF (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL5_LEN (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL5_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL5_OFF (10)

/** \\brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL6_LEN (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL6_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL6_OFF (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL7_LEN (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL7_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL7_OFF (14)

/** \\brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL8 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL8_LEN (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL8 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL8_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL8 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL8_OFF (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL9 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL9_LEN (2)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL9 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL9_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL9 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL9_OFF (18)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH0SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH0SEL_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH0SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH0SEL_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH0SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH0SEL_OFF (0)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH1SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH1SEL_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH1SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH1SEL_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH1SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH1SEL_OFF (4)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH2SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH2SEL_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH2SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH2SEL_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH2SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH2SEL_OFF (8)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH3SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH3SEL_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH3SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH3SEL_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH3SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH3SEL_OFF (12)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH4SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH4SEL_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH4SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH4SEL_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH4SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH4SEL_OFF (16)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH5SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH5SEL_LEN (4)

/** \\brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH5SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH5SEL_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH5SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH5SEL_OFF (20)

/** \\brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH6SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH6SEL_LEN (4)

