HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.LSEL */
#define IFX_GTM_MAP_CTRL_LSEL_LEN (1)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.LSEL */
#define IFX_GTM_MAP_CTRL_LSEL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.LSEL */
#define IFX_GTM_MAP_CTRL_LSEL_OFF (4)

/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.SSL */
#define IFX_GTM_MAP_CTRL_SSL_LEN (3)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.SSL */
#define IFX_GTM_MAP_CTRL_SSL_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.SSL */
#define IFX_GTM_MAP_CTRL_SSL_OFF (1)

/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.TSEL */
#define IFX_GTM_MAP_CTRL_TSEL_LEN (1)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.TSEL */
#define IFX_GTM_MAP_CTRL_TSEL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.TSEL */
#define IFX_GTM_MAP_CTRL_TSEL_OFF (0)

/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.TSPP0_DLD */
#define IFX_GTM_MAP_CTRL_TSPP0_DLD_LEN (1)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP0_DLD */
#define IFX_GTM_MAP_CTRL_TSPP0_DLD_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP0_DLD */
#define IFX_GTM_MAP_CTRL_TSPP0_DLD_OFF (17)

/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.TSPP0_EN */
#define IFX_GTM_MAP_CTRL_TSPP0_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP0_EN */
#define IFX_GTM_MAP_CTRL_TSPP0_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP0_EN */
#define IFX_GTM_MAP_CTRL_TSPP0_EN_OFF (16)

/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I0V */
#define IFX_GTM_MAP_CTRL_TSPP0_I0V_LEN (1)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I0V */
#define IFX_GTM_MAP_CTRL_TSPP0_I0V_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I0V */
#define IFX_GTM_MAP_CTRL_TSPP0_I0V_OFF (20)

/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I1V */
#define IFX_GTM_MAP_CTRL_TSPP0_I1V_LEN (1)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I1V */
#define IFX_GTM_MAP_CTRL_TSPP0_I1V_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I1V */
#define IFX_GTM_MAP_CTRL_TSPP0_I1V_OFF (21)

/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I2V */
#define IFX_GTM_MAP_CTRL_TSPP0_I2V_LEN (1)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I2V */
#define IFX_GTM_MAP_CTRL_TSPP0_I2V_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP0_I2V */
#define IFX_GTM_MAP_CTRL_TSPP0_I2V_OFF (22)

/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.TSPP1_DLD */
#define IFX_GTM_MAP_CTRL_TSPP1_DLD_LEN (1)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP1_DLD */
#define IFX_GTM_MAP_CTRL_TSPP1_DLD_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP1_DLD */
#define IFX_GTM_MAP_CTRL_TSPP1_DLD_OFF (25)

/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.TSPP1_EN */
#define IFX_GTM_MAP_CTRL_TSPP1_EN_LEN (1)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP1_EN */
#define IFX_GTM_MAP_CTRL_TSPP1_EN_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP1_EN */
#define IFX_GTM_MAP_CTRL_TSPP1_EN_OFF (24)

/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I0V */
#define IFX_GTM_MAP_CTRL_TSPP1_I0V_LEN (1)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I0V */
#define IFX_GTM_MAP_CTRL_TSPP1_I0V_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I0V */
#define IFX_GTM_MAP_CTRL_TSPP1_I0V_OFF (28)

/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I1V */
#define IFX_GTM_MAP_CTRL_TSPP1_I1V_LEN (1)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I1V */
#define IFX_GTM_MAP_CTRL_TSPP1_I1V_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I1V */
#define IFX_GTM_MAP_CTRL_TSPP1_I1V_OFF (29)

/** \\brief  Length for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I2V */
#define IFX_GTM_MAP_CTRL_TSPP1_I2V_LEN (1)

/** \\brief  Mask for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I2V */
#define IFX_GTM_MAP_CTRL_TSPP1_I2V_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MAP_CTRL_Bits.TSPP1_I2V */
#define IFX_GTM_MAP_CTRL_TSPP1_I2V_OFF (30)

/** \\brief  Length for Ifx_GTM_MCFG_CTRL_Bits.MEM0 */
#define IFX_GTM_MCFG_CTRL_MEM0_LEN (2)

/** \\brief  Mask for Ifx_GTM_MCFG_CTRL_Bits.MEM0 */
#define IFX_GTM_MCFG_CTRL_MEM0_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MCFG_CTRL_Bits.MEM0 */
#define IFX_GTM_MCFG_CTRL_MEM0_OFF (0)

/** \\brief  Length for Ifx_GTM_MCFG_CTRL_Bits.MEM1 */
#define IFX_GTM_MCFG_CTRL_MEM1_LEN (2)

/** \\brief  Mask for Ifx_GTM_MCFG_CTRL_Bits.MEM1 */
#define IFX_GTM_MCFG_CTRL_MEM1_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MCFG_CTRL_Bits.MEM1 */
#define IFX_GTM_MCFG_CTRL_MEM1_OFF (2)

/** \\brief  Length for Ifx_GTM_MCFG_CTRL_Bits.MEM2 */
#define IFX_GTM_MCFG_CTRL_MEM2_LEN (2)

/** \\brief  Mask for Ifx_GTM_MCFG_CTRL_Bits.MEM2 */
#define IFX_GTM_MCFG_CTRL_MEM2_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MCFG_CTRL_Bits.MEM2 */
#define IFX_GTM_MCFG_CTRL_MEM2_OFF (4)

/** \\brief  Length for Ifx_GTM_MCFG_CTRL_Bits.MEM3 */
#define IFX_GTM_MCFG_CTRL_MEM3_LEN (2)

/** \\brief  Mask for Ifx_GTM_MCFG_CTRL_Bits.MEM3 */
#define IFX_GTM_MCFG_CTRL_MEM3_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MCFG_CTRL_Bits.MEM3 */
#define IFX_GTM_MCFG_CTRL_MEM3_OFF (6)

/** \\brief  Length for Ifx_GTM_MCFG_CTRL_Bits.MEM4 */
#define IFX_GTM_MCFG_CTRL_MEM4_LEN (2)

/** \\brief  Mask for Ifx_GTM_MCFG_CTRL_Bits.MEM4 */
#define IFX_GTM_MCFG_CTRL_MEM4_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MCFG_CTRL_Bits.MEM4 */
#define IFX_GTM_MCFG_CTRL_MEM4_OFF (8)

/** \\brief  Length for Ifx_GTM_MCFG_CTRL_Bits.MEM5 */
#define IFX_GTM_MCFG_CTRL_MEM5_LEN (2)

/** \\brief  Mask for Ifx_GTM_MCFG_CTRL_Bits.MEM5 */
#define IFX_GTM_MCFG_CTRL_MEM5_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_MCFG_CTRL_Bits.MEM5 */
#define IFX_GTM_MCFG_CTRL_MEM5_OFF (10)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG0 */
#define IFX_GTM_MCS_CH0_CTRG_TRG0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG0 */
#define IFX_GTM_MCS_CH0_CTRG_TRG0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG0 */
#define IFX_GTM_MCS_CH0_CTRG_TRG0_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_CH0_CTRG_Bits.TRG10 */
#define IFX_GTM_MCS_CH0_CTRG_TRG10_LEN (1)

