HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.CAT4 */
#define IFX_GTM_MCS_RST_CAT4_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.CAT4 */
#define IFX_GTM_MCS_RST_CAT4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.CAT4 */
#define IFX_GTM_MCS_RST_CAT4_OFF (12)

/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.CAT5 */
#define IFX_GTM_MCS_RST_CAT5_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.CAT5 */
#define IFX_GTM_MCS_RST_CAT5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.CAT5 */
#define IFX_GTM_MCS_RST_CAT5_OFF (13)

/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.CAT6 */
#define IFX_GTM_MCS_RST_CAT6_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.CAT6 */
#define IFX_GTM_MCS_RST_CAT6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.CAT6 */
#define IFX_GTM_MCS_RST_CAT6_OFF (14)

/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.CAT7 */
#define IFX_GTM_MCS_RST_CAT7_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.CAT7 */
#define IFX_GTM_MCS_RST_CAT7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.CAT7 */
#define IFX_GTM_MCS_RST_CAT7_OFF (15)

/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.CWT0 */
#define IFX_GTM_MCS_RST_CWT0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.CWT0 */
#define IFX_GTM_MCS_RST_CWT0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.CWT0 */
#define IFX_GTM_MCS_RST_CWT0_OFF (16)

/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.CWT1 */
#define IFX_GTM_MCS_RST_CWT1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.CWT1 */
#define IFX_GTM_MCS_RST_CWT1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.CWT1 */
#define IFX_GTM_MCS_RST_CWT1_OFF (17)

/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.CWT2 */
#define IFX_GTM_MCS_RST_CWT2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.CWT2 */
#define IFX_GTM_MCS_RST_CWT2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.CWT2 */
#define IFX_GTM_MCS_RST_CWT2_OFF (18)

/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.CWT3 */
#define IFX_GTM_MCS_RST_CWT3_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.CWT3 */
#define IFX_GTM_MCS_RST_CWT3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.CWT3 */
#define IFX_GTM_MCS_RST_CWT3_OFF (19)

/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.CWT4 */
#define IFX_GTM_MCS_RST_CWT4_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.CWT4 */
#define IFX_GTM_MCS_RST_CWT4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.CWT4 */
#define IFX_GTM_MCS_RST_CWT4_OFF (20)

/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.CWT5 */
#define IFX_GTM_MCS_RST_CWT5_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.CWT5 */
#define IFX_GTM_MCS_RST_CWT5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.CWT5 */
#define IFX_GTM_MCS_RST_CWT5_OFF (21)

/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.CWT6 */
#define IFX_GTM_MCS_RST_CWT6_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.CWT6 */
#define IFX_GTM_MCS_RST_CWT6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.CWT6 */
#define IFX_GTM_MCS_RST_CWT6_OFF (22)

/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.CWT7 */
#define IFX_GTM_MCS_RST_CWT7_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.CWT7 */
#define IFX_GTM_MCS_RST_CWT7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.CWT7 */
#define IFX_GTM_MCS_RST_CWT7_OFF (23)

/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.RST0 */
#define IFX_GTM_MCS_RST_RST0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.RST0 */
#define IFX_GTM_MCS_RST_RST0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.RST0 */
#define IFX_GTM_MCS_RST_RST0_OFF (0)

/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.RST1 */
#define IFX_GTM_MCS_RST_RST1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.RST1 */
#define IFX_GTM_MCS_RST_RST1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.RST1 */
#define IFX_GTM_MCS_RST_RST1_OFF (1)

/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.RST2 */
#define IFX_GTM_MCS_RST_RST2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.RST2 */
#define IFX_GTM_MCS_RST_RST2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.RST2 */
#define IFX_GTM_MCS_RST_RST2_OFF (2)

/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.RST3 */
#define IFX_GTM_MCS_RST_RST3_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.RST3 */
#define IFX_GTM_MCS_RST_RST3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.RST3 */
#define IFX_GTM_MCS_RST_RST3_OFF (3)

/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.RST4 */
#define IFX_GTM_MCS_RST_RST4_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.RST4 */
#define IFX_GTM_MCS_RST_RST4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.RST4 */
#define IFX_GTM_MCS_RST_RST4_OFF (4)

/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.RST5 */
#define IFX_GTM_MCS_RST_RST5_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.RST5 */
#define IFX_GTM_MCS_RST_RST5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.RST5 */
#define IFX_GTM_MCS_RST_RST5_OFF (5)

/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.RST6 */
#define IFX_GTM_MCS_RST_RST6_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.RST6 */
#define IFX_GTM_MCS_RST_RST6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.RST6 */
#define IFX_GTM_MCS_RST_RST6_OFF (6)

/** \\brief  Length for Ifx_GTM_MCS_RST_Bits.RST7 */
#define IFX_GTM_MCS_RST_RST7_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCS_RST_Bits.RST7 */
#define IFX_GTM_MCS_RST_RST7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCS_RST_Bits.RST7 */
#define IFX_GTM_MCS_RST_RST7_OFF (7)

/** \\brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS000 */
#define IFX_GTM_MCSINTCLR_MCS000_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS000 */
#define IFX_GTM_MCSINTCLR_MCS000_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS000 */
#define IFX_GTM_MCSINTCLR_MCS000_OFF (0)

/** \\brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS001 */
#define IFX_GTM_MCSINTCLR_MCS001_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS001 */
#define IFX_GTM_MCSINTCLR_MCS001_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS001 */
#define IFX_GTM_MCSINTCLR_MCS001_OFF (1)

