HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS510 */
#define IFX_GTM_MCSINTCLR_MCS510_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS510 */
#define IFX_GTM_MCSINTCLR_MCS510_OFF (22)

/** \\brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS511 */
#define IFX_GTM_MCSINTCLR_MCS511_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS511 */
#define IFX_GTM_MCSINTCLR_MCS511_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS511 */
#define IFX_GTM_MCSINTCLR_MCS511_OFF (23)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS000 */
#define IFX_GTM_MCSINTSTAT_MCS000_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS000 */
#define IFX_GTM_MCSINTSTAT_MCS000_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS000 */
#define IFX_GTM_MCSINTSTAT_MCS000_OFF (0)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS001 */
#define IFX_GTM_MCSINTSTAT_MCS001_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS001 */
#define IFX_GTM_MCSINTSTAT_MCS001_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS001 */
#define IFX_GTM_MCSINTSTAT_MCS001_OFF (1)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS010 */
#define IFX_GTM_MCSINTSTAT_MCS010_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS010 */
#define IFX_GTM_MCSINTSTAT_MCS010_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS010 */
#define IFX_GTM_MCSINTSTAT_MCS010_OFF (2)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS011 */
#define IFX_GTM_MCSINTSTAT_MCS011_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS011 */
#define IFX_GTM_MCSINTSTAT_MCS011_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS011 */
#define IFX_GTM_MCSINTSTAT_MCS011_OFF (3)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS100 */
#define IFX_GTM_MCSINTSTAT_MCS100_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS100 */
#define IFX_GTM_MCSINTSTAT_MCS100_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS100 */
#define IFX_GTM_MCSINTSTAT_MCS100_OFF (4)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS101 */
#define IFX_GTM_MCSINTSTAT_MCS101_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS101 */
#define IFX_GTM_MCSINTSTAT_MCS101_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS101 */
#define IFX_GTM_MCSINTSTAT_MCS101_OFF (5)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS110 */
#define IFX_GTM_MCSINTSTAT_MCS110_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS110 */
#define IFX_GTM_MCSINTSTAT_MCS110_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS110 */
#define IFX_GTM_MCSINTSTAT_MCS110_OFF (6)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS111 */
#define IFX_GTM_MCSINTSTAT_MCS111_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS111 */
#define IFX_GTM_MCSINTSTAT_MCS111_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS111 */
#define IFX_GTM_MCSINTSTAT_MCS111_OFF (7)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS200 */
#define IFX_GTM_MCSINTSTAT_MCS200_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS200 */
#define IFX_GTM_MCSINTSTAT_MCS200_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS200 */
#define IFX_GTM_MCSINTSTAT_MCS200_OFF (8)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS201 */
#define IFX_GTM_MCSINTSTAT_MCS201_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS201 */
#define IFX_GTM_MCSINTSTAT_MCS201_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS201 */
#define IFX_GTM_MCSINTSTAT_MCS201_OFF (9)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS210 */
#define IFX_GTM_MCSINTSTAT_MCS210_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS210 */
#define IFX_GTM_MCSINTSTAT_MCS210_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS210 */
#define IFX_GTM_MCSINTSTAT_MCS210_OFF (10)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS211 */
#define IFX_GTM_MCSINTSTAT_MCS211_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS211 */
#define IFX_GTM_MCSINTSTAT_MCS211_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS211 */
#define IFX_GTM_MCSINTSTAT_MCS211_OFF (11)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS300 */
#define IFX_GTM_MCSINTSTAT_MCS300_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS300 */
#define IFX_GTM_MCSINTSTAT_MCS300_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS300 */
#define IFX_GTM_MCSINTSTAT_MCS300_OFF (12)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS301 */
#define IFX_GTM_MCSINTSTAT_MCS301_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS301 */
#define IFX_GTM_MCSINTSTAT_MCS301_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS301 */
#define IFX_GTM_MCSINTSTAT_MCS301_OFF (13)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS310 */
#define IFX_GTM_MCSINTSTAT_MCS310_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS310 */
#define IFX_GTM_MCSINTSTAT_MCS310_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS310 */
#define IFX_GTM_MCSINTSTAT_MCS310_OFF (14)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS311 */
#define IFX_GTM_MCSINTSTAT_MCS311_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS311 */
#define IFX_GTM_MCSINTSTAT_MCS311_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS311 */
#define IFX_GTM_MCSINTSTAT_MCS311_OFF (15)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS400 */
#define IFX_GTM_MCSINTSTAT_MCS400_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS400 */
#define IFX_GTM_MCSINTSTAT_MCS400_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS400 */
#define IFX_GTM_MCSINTSTAT_MCS400_OFF (16)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS401 */
#define IFX_GTM_MCSINTSTAT_MCS401_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS401 */
#define IFX_GTM_MCSINTSTAT_MCS401_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS401 */
#define IFX_GTM_MCSINTSTAT_MCS401_OFF (17)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS410 */
#define IFX_GTM_MCSINTSTAT_MCS410_LEN (1)

