HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_0 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_0 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_0 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_0_OFF (0)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_1 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_1 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_1 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_1_OFF (1)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_2 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_2 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_2 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_2_OFF (2)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_3 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_3_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_3 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_3 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_3_OFF (3)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_4 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_4_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_4 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_4 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_4_OFF (4)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_5 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_5_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_5 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_5 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_5_OFF (5)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_6 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_6_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_6 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_6 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_6_OFF (6)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_7 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_7_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_7 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_4_7 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_4_7_OFF (7)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_0 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_0 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_0 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_0_OFF (8)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_1 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_1 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_1 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_1_OFF (9)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_2 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_2 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_2 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_2_OFF (10)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_3 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_3_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_3 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_3 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_3_OFF (11)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_4 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_4_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_4 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_4 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_4_OFF (12)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_5 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_5_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_5 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_5 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_5_OFF (13)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_6 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_6_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_6 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_6 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_6_OFF (14)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_7 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_7_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_7 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_1_Bits.MCA_5_7 */
#define IFX_GTM_MON_ACTIVITY_1_MCA_5_7_OFF (15)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMU0 */
#define IFX_GTM_MON_STATUS_ACT_CMU0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMU0 */
#define IFX_GTM_MON_STATUS_ACT_CMU0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMU0 */
#define IFX_GTM_MON_STATUS_ACT_CMU0_OFF (0)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMU1 */
#define IFX_GTM_MON_STATUS_ACT_CMU1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMU1 */
#define IFX_GTM_MON_STATUS_ACT_CMU1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMU1 */
#define IFX_GTM_MON_STATUS_ACT_CMU1_OFF (1)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMU2 */
#define IFX_GTM_MON_STATUS_ACT_CMU2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMU2 */
#define IFX_GTM_MON_STATUS_ACT_CMU2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMU2 */
#define IFX_GTM_MON_STATUS_ACT_CMU2_OFF (2)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMU3 */
#define IFX_GTM_MON_STATUS_ACT_CMU3_LEN (1)

