HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_bf.h
/** \\brief  Length for Ifx_GTM_SPE_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_SPE_IRQ_MODE_IRQ_MODE_LEN (2)

/** \\brief  Mask for Ifx_GTM_SPE_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_SPE_IRQ_MODE_IRQ_MODE_MSK (0x3)

/** \\brief  Offset for Ifx_GTM_SPE_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_SPE_IRQ_MODE_IRQ_MODE_OFF (0)

/** \\brief  Length for Ifx_GTM_SPE_IRQ_NOTIFY_Bits.SPE_BIS */
#define IFX_GTM_SPE_IRQ_NOTIFY_SPE_BIS_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_IRQ_NOTIFY_Bits.SPE_BIS */
#define IFX_GTM_SPE_IRQ_NOTIFY_SPE_BIS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_IRQ_NOTIFY_Bits.SPE_BIS */
#define IFX_GTM_SPE_IRQ_NOTIFY_SPE_BIS_OFF (3)

/** \\brief  Length for Ifx_GTM_SPE_IRQ_NOTIFY_Bits.SPE_DCHG */
#define IFX_GTM_SPE_IRQ_NOTIFY_SPE_DCHG_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_IRQ_NOTIFY_Bits.SPE_DCHG */
#define IFX_GTM_SPE_IRQ_NOTIFY_SPE_DCHG_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_IRQ_NOTIFY_Bits.SPE_DCHG */
#define IFX_GTM_SPE_IRQ_NOTIFY_SPE_DCHG_OFF (1)

/** \\brief  Length for Ifx_GTM_SPE_IRQ_NOTIFY_Bits.SPE_NIPD */
#define IFX_GTM_SPE_IRQ_NOTIFY_SPE_NIPD_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_IRQ_NOTIFY_Bits.SPE_NIPD */
#define IFX_GTM_SPE_IRQ_NOTIFY_SPE_NIPD_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_IRQ_NOTIFY_Bits.SPE_NIPD */
#define IFX_GTM_SPE_IRQ_NOTIFY_SPE_NIPD_OFF (0)

/** \\brief  Length for Ifx_GTM_SPE_IRQ_NOTIFY_Bits.SPE_PERR */
#define IFX_GTM_SPE_IRQ_NOTIFY_SPE_PERR_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_IRQ_NOTIFY_Bits.SPE_PERR */
#define IFX_GTM_SPE_IRQ_NOTIFY_SPE_PERR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_IRQ_NOTIFY_Bits.SPE_PERR */
#define IFX_GTM_SPE_IRQ_NOTIFY_SPE_PERR_OFF (2)

/** \\brief  Length for Ifx_GTM_SPE_IRQ_NOTIFY_Bits.SPE_RCMP */
#define IFX_GTM_SPE_IRQ_NOTIFY_SPE_RCMP_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_IRQ_NOTIFY_Bits.SPE_RCMP */
#define IFX_GTM_SPE_IRQ_NOTIFY_SPE_RCMP_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_IRQ_NOTIFY_Bits.SPE_RCMP */
#define IFX_GTM_SPE_IRQ_NOTIFY_SPE_RCMP_OFF (4)

/** \\brief  Length for Ifx_GTM_SPE_OUT_CTRL_Bits.SPE_OUT_CTRL */
#define IFX_GTM_SPE_OUT_CTRL_SPE_OUT_CTRL_LEN (16)

/** \\brief  Mask for Ifx_GTM_SPE_OUT_CTRL_Bits.SPE_OUT_CTRL */
#define IFX_GTM_SPE_OUT_CTRL_SPE_OUT_CTRL_MSK (0xffff)

/** \\brief  Offset for Ifx_GTM_SPE_OUT_CTRL_Bits.SPE_OUT_CTRL */
#define IFX_GTM_SPE_OUT_CTRL_SPE_OUT_CTRL_OFF (0)

/** \\brief  Length for Ifx_GTM_SPE_OUT_PAT_Bits.SPE_OUT_PAT */
#define IFX_GTM_SPE_OUT_PAT_SPE_OUT_PAT_LEN (16)

/** \\brief  Mask for Ifx_GTM_SPE_OUT_PAT_Bits.SPE_OUT_PAT */
#define IFX_GTM_SPE_OUT_PAT_SPE_OUT_PAT_MSK (0xffff)

/** \\brief  Offset for Ifx_GTM_SPE_OUT_PAT_Bits.SPE_OUT_PAT */
#define IFX_GTM_SPE_OUT_PAT_SPE_OUT_PAT_OFF (0)

/** \\brief  Length for Ifx_GTM_SPE_PAT_Bits.IP0_PAT */
#define IFX_GTM_SPE_PAT_IP0_PAT_LEN (3)

/** \\brief  Mask for Ifx_GTM_SPE_PAT_Bits.IP0_PAT */
#define IFX_GTM_SPE_PAT_IP0_PAT_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_SPE_PAT_Bits.IP0_PAT */
#define IFX_GTM_SPE_PAT_IP0_PAT_OFF (1)

/** \\brief  Length for Ifx_GTM_SPE_PAT_Bits.IP0_VAL */
#define IFX_GTM_SPE_PAT_IP0_VAL_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_PAT_Bits.IP0_VAL */
#define IFX_GTM_SPE_PAT_IP0_VAL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_PAT_Bits.IP0_VAL */
#define IFX_GTM_SPE_PAT_IP0_VAL_OFF (0)

/** \\brief  Length for Ifx_GTM_SPE_PAT_Bits.IP1_PAT */
#define IFX_GTM_SPE_PAT_IP1_PAT_LEN (3)

/** \\brief  Mask for Ifx_GTM_SPE_PAT_Bits.IP1_PAT */
#define IFX_GTM_SPE_PAT_IP1_PAT_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_SPE_PAT_Bits.IP1_PAT */
#define IFX_GTM_SPE_PAT_IP1_PAT_OFF (5)

/** \\brief  Length for Ifx_GTM_SPE_PAT_Bits.IP1_VAL */
#define IFX_GTM_SPE_PAT_IP1_VAL_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_PAT_Bits.IP1_VAL */
#define IFX_GTM_SPE_PAT_IP1_VAL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_PAT_Bits.IP1_VAL */
#define IFX_GTM_SPE_PAT_IP1_VAL_OFF (4)

/** \\brief  Length for Ifx_GTM_SPE_PAT_Bits.IP2_PAT */
#define IFX_GTM_SPE_PAT_IP2_PAT_LEN (3)

/** \\brief  Mask for Ifx_GTM_SPE_PAT_Bits.IP2_PAT */
#define IFX_GTM_SPE_PAT_IP2_PAT_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_SPE_PAT_Bits.IP2_PAT */
#define IFX_GTM_SPE_PAT_IP2_PAT_OFF (9)

/** \\brief  Length for Ifx_GTM_SPE_PAT_Bits.IP2_VAL */
#define IFX_GTM_SPE_PAT_IP2_VAL_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_PAT_Bits.IP2_VAL */
#define IFX_GTM_SPE_PAT_IP2_VAL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_PAT_Bits.IP2_VAL */
#define IFX_GTM_SPE_PAT_IP2_VAL_OFF (8)

/** \\brief  Length for Ifx_GTM_SPE_PAT_Bits.IP3_PAT */
#define IFX_GTM_SPE_PAT_IP3_PAT_LEN (3)

/** \\brief  Mask for Ifx_GTM_SPE_PAT_Bits.IP3_PAT */
#define IFX_GTM_SPE_PAT_IP3_PAT_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_SPE_PAT_Bits.IP3_PAT */
#define IFX_GTM_SPE_PAT_IP3_PAT_OFF (13)

/** \\brief  Length for Ifx_GTM_SPE_PAT_Bits.IP3_VAL */
#define IFX_GTM_SPE_PAT_IP3_VAL_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_PAT_Bits.IP3_VAL */
#define IFX_GTM_SPE_PAT_IP3_VAL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_PAT_Bits.IP3_VAL */
#define IFX_GTM_SPE_PAT_IP3_VAL_OFF (12)

/** \\brief  Length for Ifx_GTM_SPE_PAT_Bits.IP4_PAT */
#define IFX_GTM_SPE_PAT_IP4_PAT_LEN (3)

/** \\brief  Mask for Ifx_GTM_SPE_PAT_Bits.IP4_PAT */
#define IFX_GTM_SPE_PAT_IP4_PAT_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_SPE_PAT_Bits.IP4_PAT */
#define IFX_GTM_SPE_PAT_IP4_PAT_OFF (17)

/** \\brief  Length for Ifx_GTM_SPE_PAT_Bits.IP4_VAL */
#define IFX_GTM_SPE_PAT_IP4_VAL_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_PAT_Bits.IP4_VAL */
#define IFX_GTM_SPE_PAT_IP4_VAL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_PAT_Bits.IP4_VAL */
#define IFX_GTM_SPE_PAT_IP4_VAL_OFF (16)

/** \\brief  Length for Ifx_GTM_SPE_PAT_Bits.IP5_PAT */
#define IFX_GTM_SPE_PAT_IP5_PAT_LEN (3)

/** \\brief  Mask for Ifx_GTM_SPE_PAT_Bits.IP5_PAT */
#define IFX_GTM_SPE_PAT_IP5_PAT_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_SPE_PAT_Bits.IP5_PAT */
#define IFX_GTM_SPE_PAT_IP5_PAT_OFF (21)

/** \\brief  Length for Ifx_GTM_SPE_PAT_Bits.IP5_VAL */
#define IFX_GTM_SPE_PAT_IP5_VAL_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_PAT_Bits.IP5_VAL */
#define IFX_GTM_SPE_PAT_IP5_VAL_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_PAT_Bits.IP5_VAL */
#define IFX_GTM_SPE_PAT_IP5_VAL_OFF (20)

/** \\brief  Length for Ifx_GTM_SPE_PAT_Bits.IP6_PAT */
#define IFX_GTM_SPE_PAT_IP6_PAT_LEN (3)

/** \\brief  Mask for Ifx_GTM_SPE_PAT_Bits.IP6_PAT */
#define IFX_GTM_SPE_PAT_IP6_PAT_MSK (0x7)

